Starting pipeline tracker...
 The pipeline tracker has finished
 All inputs have been entered properly. The program will now run.
 Loading files from /home/greg/data_process/fascin/particle_picking/../../../../../scratch/neural_network_training_sets/fascin_noise/
 All files loaded and parsed into training and validation sets.
 Beginning training
 __________________________________________________________________________________________________
 Layer (type)                    Output Shape         Param #     Connected to                     
 ==================================================================================================
 input_1 (InputLayer)            (None, 192, 192, 1)  0                                            
 __________________________________________________________________________________________________
 conv2d_1 (Conv2D)               (None, 192, 192, 64) 640         input_1[0][0]                    
 __________________________________________________________________________________________________
 conv2d_2 (Conv2D)               (None, 192, 192, 128 73856       conv2d_1[0][0]                   
 __________________________________________________________________________________________________
 conv2d_3 (Conv2D)               (None, 192, 192, 128 147584      conv2d_2[0][0]                   
 __________________________________________________________________________________________________
 conv2d_4 (Conv2D)               (None, 192, 192, 128 16512       conv2d_3[0][0]                   
 __________________________________________________________________________________________________
 conv2d_5 (Conv2D)               (None, 192, 192, 128 147584      conv2d_4[0][0]                   
 __________________________________________________________________________________________________
 max_pooling2d_1 (MaxPooling2D)  (None, 96, 96, 128)  0           conv2d_5[0][0]                   
 __________________________________________________________________________________________________
 conv2d_6 (Conv2D)               (None, 96, 96, 168)  193704      max_pooling2d_1[0][0]            
 __________________________________________________________________________________________________
 conv2d_7 (Conv2D)               (None, 96, 96, 168)  254184      conv2d_6[0][0]                   
 __________________________________________________________________________________________________
 conv2d_8 (Conv2D)               (None, 96, 96, 168)  28392       conv2d_7[0][0]                   
 __________________________________________________________________________________________________
 conv2d_9 (Conv2D)               (None, 96, 96, 168)  254184      conv2d_8[0][0]                   
 __________________________________________________________________________________________________
 max_pooling2d_2 (MaxPooling2D)  (None, 48, 48, 168)  0           conv2d_9[0][0]                   
 __________________________________________________________________________________________________
 conv2d_10 (Conv2D)              (None, 48, 48, 192)  290496      max_pooling2d_2[0][0]            
 __________________________________________________________________________________________________
 conv2d_11 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_10[0][0]                  
 __________________________________________________________________________________________________
 conv2d_12 (Conv2D)              (None, 48, 48, 192)  37056       conv2d_11[0][0]                  
 __________________________________________________________________________________________________
 conv2d_13 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_12[0][0]                  
 __________________________________________________________________________________________________
 max_pooling2d_3 (MaxPooling2D)  (None, 24, 24, 192)  0           conv2d_13[0][0]                  
 __________________________________________________________________________________________________
 conv2d_14 (Conv2D)              (None, 24, 24, 256)  442624      max_pooling2d_3[0][0]            
 __________________________________________________________________________________________________
 conv2d_15 (Conv2D)              (None, 24, 24, 256)  590080      conv2d_14[0][0]                  
 __________________________________________________________________________________________________
 conv2d_16 (Conv2D)              (None, 24, 24, 256)  65792       conv2d_15[0][0]                  
 __________________________________________________________________________________________________
 conv2d_17 (Conv2D)              (None, 24, 24, 256)  590080      conv2d_16[0][0]                  
 __________________________________________________________________________________________________
 up_sampling2d_1 (UpSampling2D)  (None, 48, 48, 256)  0           conv2d_17[0][0]                  
 __________________________________________________________________________________________________
 concatenate_1 (Concatenate)     (None, 48, 48, 448)  0           up_sampling2d_1[0][0]            
                                                                  conv2d_13[0][0]                  
 __________________________________________________________________________________________________
 conv2d_18 (Conv2D)              (None, 48, 48, 192)  774336      concatenate_1[0][0]              
 __________________________________________________________________________________________________
 conv2d_19 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_18[0][0]                  
 __________________________________________________________________________________________________
 conv2d_20 (Conv2D)              (None, 48, 48, 192)  37056       conv2d_19[0][0]                  
 __________________________________________________________________________________________________
 conv2d_21 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_20[0][0]                  
 __________________________________________________________________________________________________
 up_sampling2d_2 (UpSampling2D)  (None, 96, 96, 192)  0           conv2d_21[0][0]                  
 __________________________________________________________________________________________________
 concatenate_2 (Concatenate)     (None, 96, 96, 360)  0           up_sampling2d_2[0][0]            
                                                                  conv2d_9[0][0]                   
 __________________________________________________________________________________________________
 conv2d_22 (Conv2D)              (None, 96, 96, 168)  544488      concatenate_2[0][0]              
 __________________________________________________________________________________________________
 conv2d_23 (Conv2D)              (None, 96, 96, 168)  254184      conv2d_22[0][0]                  
 __________________________________________________________________________________________________
 conv2d_24 (Conv2D)              (None, 96, 96, 168)  28392       conv2d_23[0][0]                  
 __________________________________________________________________________________________________
 conv2d_25 (Conv2D)              (None, 96, 96, 168)  254184      conv2d_24[0][0]                  
 __________________________________________________________________________________________________
 up_sampling2d_3 (UpSampling2D)  (None, 192, 192, 168 0           conv2d_25[0][0]                  
 __________________________________________________________________________________________________
 concatenate_3 (Concatenate)     (None, 192, 192, 296 0           up_sampling2d_3[0][0]            
                                                                  conv2d_5[0][0]                   
 __________________________________________________________________________________________________
 conv2d_26 (Conv2D)              (None, 192, 192, 128 341120      concatenate_3[0][0]              
 __________________________________________________________________________________________________
 conv2d_27 (Conv2D)              (None, 192, 192, 128 147584      conv2d_26[0][0]                  
 __________________________________________________________________________________________________
 conv2d_28 (Conv2D)              (None, 192, 192, 128 147584      conv2d_27[0][0]                  
 __________________________________________________________________________________________________
 conv2d_29 (Conv2D)              (None, 192, 192, 128 16512       conv2d_28[0][0]                  
 __________________________________________________________________________________________________
 conv2d_30 (Conv2D)              (None, 192, 192, 64) 73792       conv2d_29[0][0]                  
 __________________________________________________________________________________________________
 conv2d_31 (Conv2D)              (None, 192, 192, 1)  65          conv2d_30[0][0]                  
 ==================================================================================================
 Total params: 7,079,937
 Trainable params: 7,079,937
 Non-trainable params: 0
 __________________________________________________________________________________________________
 Train on 135000 samples, validate on 14998 samples
 Epoch 1/30
 135000/135000 [==============================] - 4069s 30ms/step - loss: -0.8259 - mean_squared_error: 0.6272 - val_loss: -0.8631 - val_mean_squared_error: 0.5615
 Epoch 2/30
 135000/135000 [==============================] - 4044s 30ms/step - loss: -0.8698 - mean_squared_error: 0.5281 - val_loss: -0.8813 - val_mean_squared_error: 0.4858
 Epoch 3/30
 135000/135000 [==============================] - 4046s 30ms/step - loss: -0.8853 - mean_squared_error: 0.4403 - val_loss: -0.8894 - val_mean_squared_error: 0.4079
 Epoch 4/30
 135000/135000 [==============================] - 4045s 30ms/step - loss: -0.8942 - mean_squared_error: 0.3623 - val_loss: -0.8958 - val_mean_squared_error: 0.3136
 Epoch 5/30
 135000/135000 [==============================] - 4046s 30ms/step - loss: -0.9006 - mean_squared_error: 0.3050 - val_loss: -0.9034 - val_mean_squared_error: 0.2825
 Epoch 6/30
 135000/135000 [==============================] - 4044s 30ms/step - loss: -0.9054 - mean_squared_error: 0.2651 - val_loss: -0.9000 - val_mean_squared_error: 0.2428
 Epoch 7/30
 135000/135000 [==============================] - 4043s 30ms/step - loss: -0.9095 - mean_squared_error: 0.2300 - val_loss: -0.9082 - val_mean_squared_error: 0.2144
 Epoch 8/30
 135000/135000 [==============================] - 4040s 30ms/step - loss: -0.9129 - mean_squared_error: 0.1981 - val_loss: -0.9093 - val_mean_squared_error: 0.1819
 Epoch 9/30
 135000/135000 [==============================] - 4036s 30ms/step - loss: -0.9162 - mean_squared_error: 0.1730 - val_loss: -0.9105 - val_mean_squared_error: 0.1654
 Epoch 10/30
 135000/135000 [==============================] - 4037s 30ms/step - loss: -0.9193 - mean_squared_error: 0.1530 - val_loss: -0.9128 - val_mean_squared_error: 0.1596
 Epoch 11/30
 135000/135000 [==============================] - 4038s 30ms/step - loss: -0.9219 - mean_squared_error: 0.1376 - val_loss: -0.9168 - val_mean_squared_error: 0.1375
 Epoch 12/30
 135000/135000 [==============================] - 4040s 30ms/step - loss: -0.9246 - mean_squared_error: 0.1259 - val_loss: -0.9111 - val_mean_squared_error: 0.1336
 Epoch 13/30
 135000/135000 [==============================] - 4041s 30ms/step - loss: -0.9272 - mean_squared_error: 0.1181 - val_loss: -0.9181 - val_mean_squared_error: 0.1276
 Epoch 14/30
 135000/135000 [==============================] - 4039s 30ms/step - loss: -0.9296 - mean_squared_error: 0.1130 - val_loss: -0.9170 - val_mean_squared_error: 0.1319
 Epoch 15/30
 135000/135000 [==============================] - 4037s 30ms/step - loss: -0.9318 - mean_squared_error: 0.1108 - val_loss: -0.9177 - val_mean_squared_error: 0.1217
 Epoch 16/30
 135000/135000 [==============================] - 4038s 30ms/step - loss: -0.9338 - mean_squared_error: 0.1124 - val_loss: -0.9179 - val_mean_squared_error: 0.1727
 Restoring model weights from the end of the best epoch
 Epoch 00016: early stopping
 Model finished training.
 Saving model as train_networks/job014/fig_300000training_tplastin_CCC00000.h5
 Finished everything.
 Exiting...
