Starting pipeline tracker...
 The pipeline tracker has finishedBeginning to import packages...
 Packages finished importing. Data will now be loaded
 All inputs have been entered properly. The program will now run.
 Loading files from /home/greg/data_process/fascin/particle_picking/../../../../../scratch/neural_network_training_sets/fascin_noise/
 All files loaded and parsed into training and validation sets.
 Beginning training
 __________________________________________________________________________________________________
 Layer (type)                    Output Shape         Param #     Connected to                     
 ==================================================================================================
 input_1 (InputLayer)            (None, 192, 192, 1)  0                                            
 __________________________________________________________________________________________________
 conv2d_1 (Conv2D)               (None, 192, 192, 64) 640         input_1[0][0]                    
 __________________________________________________________________________________________________
 conv2d_2 (Conv2D)               (None, 192, 192, 128 73856       conv2d_1[0][0]                   
 __________________________________________________________________________________________________
 conv2d_3 (Conv2D)               (None, 192, 192, 128 147584      conv2d_2[0][0]                   
 __________________________________________________________________________________________________
 conv2d_4 (Conv2D)               (None, 192, 192, 128 16512       conv2d_3[0][0]                   
 __________________________________________________________________________________________________
 conv2d_5 (Conv2D)               (None, 192, 192, 128 147584      conv2d_4[0][0]                   
 __________________________________________________________________________________________________
 max_pooling2d_1 (MaxPooling2D)  (None, 96, 96, 128)  0           conv2d_5[0][0]                   
 __________________________________________________________________________________________________
 conv2d_6 (Conv2D)               (None, 96, 96, 168)  193704      max_pooling2d_1[0][0]            
 __________________________________________________________________________________________________
 conv2d_7 (Conv2D)               (None, 96, 96, 168)  254184      conv2d_6[0][0]                   
 __________________________________________________________________________________________________
 conv2d_8 (Conv2D)               (None, 96, 96, 168)  28392       conv2d_7[0][0]                   
 __________________________________________________________________________________________________
 conv2d_9 (Conv2D)               (None, 96, 96, 168)  254184      conv2d_8[0][0]                   
 __________________________________________________________________________________________________
 max_pooling2d_2 (MaxPooling2D)  (None, 48, 48, 168)  0           conv2d_9[0][0]                   
 __________________________________________________________________________________________________
 conv2d_10 (Conv2D)              (None, 48, 48, 192)  290496      max_pooling2d_2[0][0]            
 __________________________________________________________________________________________________
 conv2d_11 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_10[0][0]                  
 __________________________________________________________________________________________________
 conv2d_12 (Conv2D)              (None, 48, 48, 192)  37056       conv2d_11[0][0]                  
 __________________________________________________________________________________________________
 conv2d_13 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_12[0][0]                  
 __________________________________________________________________________________________________
 max_pooling2d_3 (MaxPooling2D)  (None, 24, 24, 192)  0           conv2d_13[0][0]                  
 __________________________________________________________________________________________________
 conv2d_14 (Conv2D)              (None, 24, 24, 256)  442624      max_pooling2d_3[0][0]            
 __________________________________________________________________________________________________
 conv2d_15 (Conv2D)              (None, 24, 24, 256)  590080      conv2d_14[0][0]                  
 __________________________________________________________________________________________________
 conv2d_16 (Conv2D)              (None, 24, 24, 256)  65792       conv2d_15[0][0]                  
 __________________________________________________________________________________________________
 conv2d_17 (Conv2D)              (None, 24, 24, 256)  590080      conv2d_16[0][0]                  
 __________________________________________________________________________________________________
 up_sampling2d_1 (UpSampling2D)  (None, 48, 48, 256)  0           conv2d_17[0][0]                  
 __________________________________________________________________________________________________
 concatenate_1 (Concatenate)     (None, 48, 48, 448)  0           up_sampling2d_1[0][0]            
                                                                  conv2d_13[0][0]                  
 __________________________________________________________________________________________________
 conv2d_18 (Conv2D)              (None, 48, 48, 192)  774336      concatenate_1[0][0]              
 __________________________________________________________________________________________________
 conv2d_19 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_18[0][0]                  
 __________________________________________________________________________________________________
 conv2d_20 (Conv2D)              (None, 48, 48, 192)  37056       conv2d_19[0][0]                  
 __________________________________________________________________________________________________
 conv2d_21 (Conv2D)              (None, 48, 48, 192)  331968      conv2d_20[0][0]                  
 __________________________________________________________________________________________________
 up_sampling2d_2 (UpSampling2D)  (None, 96, 96, 192)  0           conv2d_21[0][0]                  
 __________________________________________________________________________________________________
 concatenate_2 (Concatenate)     (None, 96, 96, 360)  0           up_sampling2d_2[0][0]            
                                                                  conv2d_9[0][0]                   
 __________________________________________________________________________________________________
 conv2d_22 (Conv2D)              (None, 96, 96, 168)  544488      concatenate_2[0][0]              
 __________________________________________________________________________________________________
 conv2d_23 (Conv2D)              (None, 96, 96, 168)  254184      conv2d_22[0][0]                  
 __________________________________________________________________________________________________
 conv2d_24 (Conv2D)              (None, 96, 96, 168)  28392       conv2d_23[0][0]                  
 __________________________________________________________________________________________________
 conv2d_25 (Conv2D)              (None, 96, 96, 168)  254184      conv2d_24[0][0]                  
 __________________________________________________________________________________________________
 up_sampling2d_3 (UpSampling2D)  (None, 192, 192, 168 0           conv2d_25[0][0]                  
 __________________________________________________________________________________________________
 concatenate_3 (Concatenate)     (None, 192, 192, 296 0           up_sampling2d_3[0][0]            
                                                                  conv2d_5[0][0]                   
 __________________________________________________________________________________________________
 conv2d_26 (Conv2D)              (None, 192, 192, 128 341120      concatenate_3[0][0]              
 __________________________________________________________________________________________________
 conv2d_27 (Conv2D)              (None, 192, 192, 128 147584      conv2d_26[0][0]                  
 __________________________________________________________________________________________________
 conv2d_28 (Conv2D)              (None, 192, 192, 128 147584      conv2d_27[0][0]                  
 __________________________________________________________________________________________________
 conv2d_29 (Conv2D)              (None, 192, 192, 128 16512       conv2d_28[0][0]                  
 __________________________________________________________________________________________________
 conv2d_30 (Conv2D)              (None, 192, 192, 64) 73792       conv2d_29[0][0]                  
 __________________________________________________________________________________________________
 conv2d_31 (Conv2D)              (None, 192, 192, 3)  195         conv2d_30[0][0]                  
 ==================================================================================================
 Total params: 7,080,067
 Trainable params: 3,283,363
 Non-trainable params: 3,796,704
 __________________________________________________________________________________________________
 Train on 45000 samples, validate on 4999 samples
 Epoch 1/30
 45000/45000 [==============================] - 1093s 24ms/step - loss: 0.1236 - categorical_crossentropy: 0.1236 - val_loss: 0.0855 - val_categorical_crossentropy: 0.0855
 Epoch 2/30
 45000/45000 [==============================] - 1076s 24ms/step - loss: 0.0732 - categorical_crossentropy: 0.0732 - val_loss: 0.0829 - val_categorical_crossentropy: 0.0829
 Epoch 3/30
 45000/45000 [==============================] - 1073s 24ms/step - loss: 0.0706 - categorical_crossentropy: 0.0706 - val_loss: 0.0808 - val_categorical_crossentropy: 0.0808
 Epoch 4/30
 45000/45000 [==============================] - 1069s 24ms/step - loss: 0.0690 - categorical_crossentropy: 0.0690 - val_loss: 0.0802 - val_categorical_crossentropy: 0.0802
 Epoch 5/30
 45000/45000 [==============================] - 1067s 24ms/step - loss: 0.0679 - categorical_crossentropy: 0.0679 - val_loss: 0.0800 - val_categorical_crossentropy: 0.0800
 Epoch 6/30
 45000/45000 [==============================] - 1072s 24ms/step - loss: 0.0670 - categorical_crossentropy: 0.0670 - val_loss: 0.0789 - val_categorical_crossentropy: 0.0789
 Epoch 7/30
 45000/45000 [==============================] - 1066s 24ms/step - loss: 0.0663 - categorical_crossentropy: 0.0663 - val_loss: 0.0791 - val_categorical_crossentropy: 0.0791
 Epoch 8/30
 45000/45000 [==============================] - 1066s 24ms/step - loss: 0.0656 - categorical_crossentropy: 0.0656 - val_loss: 0.0794 - val_categorical_crossentropy: 0.0794
 Epoch 9/30
 45000/45000 [==============================] - 1066s 24ms/step - loss: 0.0651 - categorical_crossentropy: 0.0651 - val_loss: 0.0783 - val_categorical_crossentropy: 0.0783
 Epoch 10/30
 45000/45000 [==============================] - 1066s 24ms/step - loss: 0.0644 - categorical_crossentropy: 0.0644 - val_loss: 0.0786 - val_categorical_crossentropy: 0.0786
 Epoch 11/30
 45000/45000 [==============================] - 1065s 24ms/step - loss: 0.0640 - categorical_crossentropy: 0.0640 - val_loss: 0.0781 - val_categorical_crossentropy: 0.0781
 Epoch 12/30
 45000/45000 [==============================] - 1065s 24ms/step - loss: 0.0635 - categorical_crossentropy: 0.0635 - val_loss: 0.0781 - val_categorical_crossentropy: 0.0781
 Epoch 13/30
 45000/45000 [==============================] - 1067s 24ms/step - loss: 0.0630 - categorical_crossentropy: 0.0630 - val_loss: 0.0779 - val_categorical_crossentropy: 0.0779
 Epoch 14/30
 45000/45000 [==============================] - 1064s 24ms/step - loss: 0.0626 - categorical_crossentropy: 0.0626 - val_loss: 0.0787 - val_categorical_crossentropy: 0.0787
 Epoch 15/30
 45000/45000 [==============================] - 1064s 24ms/step - loss: 0.0622 - categorical_crossentropy: 0.0622 - val_loss: 0.0786 - val_categorical_crossentropy: 0.0786
 Epoch 16/30
 45000/45000 [==============================] - 1066s 24ms/step - loss: 0.0618 - categorical_crossentropy: 0.0618 - val_loss: 0.0785 - val_categorical_crossentropy: 0.0785
 Restoring model weights from the end of the best epoch
 Epoch 00016: early stopping
 Model finished training.
 Saving model as train_networks/job017/semSeg_50ktrain_catCrossEnt_fig.h5
 Model saved.
 Training history saved.
 Exiting...
